In [1]:
print("hello")

hello

In [6]:
print("hello world")

hello world

In [1]:
import numpy as np 
arr1 = np.array([1,2,3,4,5,6,6,7,0])

arr1

array([1, 2, 3, 4, 5, 6, 6, 7, 0])

import pandas as pd


entries = {
    'maths':[50,45,30,45,40],
    'science':[45,50,40,30,20]
}

In [3]:
df1 = pd.DataFrame(entries)

NameError: name 'pd' is not defined

In [4]:
df1

NameError: name 'df1' is not defined

In [5]:
import pandas as pd

In [6]:
entries = {
    'maths':[50,45,30,45,40],
    'science':[45,50,40,30,20]
}

In [7]:
df1 = pd.DataFrame(entries)

In [8]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [9]:
df1['maths']

0    50
1    45
2    30
3    45
4    40
Name: maths, dtype: int64

In [10]:
df1.loc[0]

maths      50
science    45
Name: 0, dtype: int64

In [12]:
df1[df1['maths'] > 40]['maths']

0    50
1    45
3    45
Name: maths, dtype: int64

In [13]:
df1[(df1['maths'] > 40) & (df1['science'] > 30)]

   maths  science
0     50       45
1     45       50

In [14]:
df1

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20

In [15]:
entries2 = {
    'maths':[40,35,50,35,30],
    'science':[15,30,30,20,25]
}

In [16]:
df2 = pd.DataFrame(entries2)

In [17]:
df2

   maths  science
0     40       15
1     35       30
2     50       30
3     35       20
4     30       25

In [18]:
df3 = pd.concat([df1,df2])

In [19]:
df3

   maths  science
0     50       45
1     45       50
2     30       40
3     45       30
4     40       20
0     40       15
1     35       30
2     50       30
3     35       20
4     30       25